{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Cast", 
      "name": "cast4", 
      "attr": {"dtype": "float16"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_2_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "80", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_3_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_4_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_4_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_4_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_4_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_tower_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_tower_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_tower_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_tower_conv_1_conv2d", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_tower_conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_tower_conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_tower_1_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_tower_1_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_tower_1_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_tower_1_conv_1_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_tower_1_conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_tower_1_conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_2_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_tower_1_conv_2_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_2_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_2_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_2_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_1_conv_2_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_tower_1_conv_2_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 1], [89, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_tower_1_conv_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool_mixed_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_2_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_tower_2_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_2_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_2_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_2_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_tower_2_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_tower_2_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 1], [98, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_tower_2_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_mixed_chconcat", 
      "attr": {"num_args": "4"}, 
      "inputs": [[51, 0, 0], [67, 0, 0], [91, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_1_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_1_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 1], [107, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_1_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_1_tower_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_1_tower_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_1_tower_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_1_tower_conv_1_conv2d", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_1_tower_conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_1_tower_conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_1_tower_1_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_1_tower_1_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_1_tower_1_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_1_tower_1_conv_1_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_1_tower_1_conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_1_tower_1_conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_2_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_1_tower_1_conv_2_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_2_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_2_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_2_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_1_conv_2_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_1_tower_1_conv_2_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 1], [147, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_1_tower_1_conv_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool_mixed_1_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_2_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_1_tower_2_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_2_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_2_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_2_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_1_tower_2_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_1_tower_2_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[152, 0, 0], [153, 0, 0], [154, 0, 0], [155, 0, 1], [156, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_1_tower_2_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_mixed_1_chconcat", 
      "attr": {"num_args": "4"}, 
      "inputs": [[109, 0, 0], [125, 0, 0], [149, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_2_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_2_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_2_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_2_tower_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_2_tower_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_2_tower_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_2_tower_conv_1_conv2d", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_2_tower_conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[177, 0, 0], [178, 0, 0], [179, 0, 0], [180, 0, 1], [181, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_2_tower_conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_2_tower_1_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_2_tower_1_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[185, 0, 0], [186, 0, 0], [187, 0, 0], [188, 0, 1], [189, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_2_tower_1_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_2_tower_1_conv_1_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_2_tower_1_conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 1], [197, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_2_tower_1_conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_2_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_2_tower_1_conv_2_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_2_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_2_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_2_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_1_conv_2_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_2_tower_1_conv_2_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[201, 0, 0], [202, 0, 0], [203, 0, 0], [204, 0, 1], [205, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_2_tower_1_conv_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool_mixed_2_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_2_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_2_tower_2_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_2_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_2_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_2_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_2_tower_2_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_2_tower_2_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[210, 0, 0], [211, 0, 0], [212, 0, 0], [213, 0, 1], [214, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_2_tower_2_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_mixed_2_chconcat", 
      "attr": {"num_args": "4"}, 
      "inputs": [[167, 0, 0], [183, 0, 0], [207, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_conv_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_3_conv_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_3_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[219, 0, 0], [220, 0, 0], [221, 0, 0], [222, 0, 1], [223, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_3_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_3_tower_conv_conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[217, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_3_tower_conv_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[227, 0, 0], [228, 0, 0], [229, 0, 0], [230, 0, 1], [231, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_3_tower_conv_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_1_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_3_tower_conv_1_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[233, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_3_tower_conv_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[235, 0, 0], [236, 0, 0], [237, 0, 0], [238, 0, 1], [239, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_3_tower_conv_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_2_conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mixed_3_tower_conv_2_conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[241, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_2_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_2_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_2_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mixed_3_tower_conv_2_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "mixed_3_tower_conv_2_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[243, 0, 0], [244, 0, 0], [245, 0, 0], [246, 0, 1], [247, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "mixed_3_tower_conv_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "Pooling", 
